TEXT = {
    "ru": {
        "start": "Привет {}, я - искусственный интеллект, который помогает родителям легче взаимодействовать с детьми и радоваться жизни с малышом.",
        "ask_problem": "Расскажите, чем я могу вам помочь?",
        "understand": "Поняла. Будем с этим работать. \nМногие трудности, с которыми родители связаны с нарушением режима сна и бодрствования у малыша. Я помогу вам скорректировать режим так, чтобы ваш малыш рос довольным и развивался, а вы наслаждались родительством.",
        "ask_child_gender": "У вас мальчик или девочка?",
        "ask_child_name": "Как зовут вашего малыша?",
        "ask_child_age": "А сколько ему месяцев?",
        "ask_food_type": "Как вы кормите ребенка?",
        "ask_user_phone": "Подскажите ваш номер телефона?",
        "ask_user_email": "И напишите ваш email. На него я смогу прислать вам ваш дневник сна.",
        "done": "Отлично, вы зарегистрировались! Теперь давайте следить за графиком вашего малыша :)",
        "rate": "Оцените сегодняшнюю ночь от 1 до 10",
    }
}
