idealdata = {
    "1": {
        "day": {
            "sleep": {
                "total": [300, 420],  # сумма всех дневных снов
                "average_duration": [20, 180],  # продолжительность одного сна
                "amount": [4, 6],  # количество снов днём
            },
            "activity": {
                "total": [420, 600],  # сумма всего времени бодрствования
                "average_duration": [70, 80],  # продолжительность 1 бодрствования
            },
            "feeding": {},  # особенности питания. пока не заморчаиваемся. сделаем позже
        },
        "night": {
            "total": [480, 600],  # продолжительность ночного сна
            "feedings": {  # количество кормлений за ночь, в зависимости от типа кормаления
                "breast": [3, 4],  # грудное вскармливание
                "formula": [1, 2],  # смесь
            },
        },
        "SLEEPS_ALL": [840, 1020],  # все дневные сны + ночной сон
    },
    "2": {
        "day": {
            "sleep": {
                "total": [300, 420],  # сумма всех дневных снов
                "average_duration": [20, 180],  # продолжительность одного сна
                "amount": [4, 6],  # количество снов днём
            },
            "activity": {
                "total": [420, 600],  # сумма всего времени бодрствования
                "average_duration": [70, 80],  # продолжительность 1 бодрствования
            },
            "feeding": {},  # особенности питания. пока не заморчаиваемся. сделаем позже
        },
        "night": {
            "total": [480, 600],  # продолжительность ночного сна
            "feedings": {  # количество кормлений за ночь, в зависимости от типа кормаления
                "breast": [3, 4],  # грудное вскармливание
                "formula": [1, 2],  # смесь
            },
        },
        "SLEEPS_ALL": [840, 1020],  # все дневные сны + ночной сон
    },
    "3": {
        "day": {
            "sleep": {
                "total": [300, 420],  # сумма всех дневных снов
                "average_duration": [20, 180],  # продолжительность одного сна
                "amount": [4, 6],  # количество снов днём
            },
            "activity": {
                "total": [420, 600],  # сумма всего времени бодрствования
                "average_duration": [80, 105],  # продолжительность 1 бодрствования
            },
            "feeding": {},  # особенности питания. пока не заморчаиваемся. сделаем позже
        },
        "night": {
            "total": [480, 600],  # продолжительность ночного сна
            "feedings": {  # количество кормлений за ночь, в зависимости от типа кормаления
                "breast": [3, 4],  # грудное вскармливание
                "formula": [1, 2],  # смесь
            },
        },
        "SLEEPS_ALL": [840, 1020],  # все дневные сны + ночной сон
    },
    "4": {
        "day": {
            "sleep": {
                "total": [210, 270],  # сумма всех дневных снов
                "average_duration": [40, 90],  # продолжительность одного сна
                "amount": [3, 4],  # количество снов днём
            },
            "activity": {
                "total": [570, 630],  # сумма всего времени бодрствования
                "average_duration": [105, 115],  # продолжительность 1 бодрствования
            },
            "feeding": {},  # особенности питания. пока не заморчаиваемся. сделаем позже
        },
        "night": {
            "total": [600, 660],  # продолжительность ночного сна
            "feedings": {  # количество кормлений за ночь, в зависимости от типа кормаления
                "breast": [3, 4],  # грудное вскармливание
                "formula": [1, 2],  # смесь
            },
        },
        "SLEEPS_ALL": [810, 870],  # все дневные сны + ночной сон
    },
    "5": {
        "day": {
            "sleep": {
                "total": [210, 270],  # сумма всех дневных снов
                "average_duration": [40, 90],  # продолжительность одного сна
                "amount": [3, 4],  # количество снов днём
            },
            "activity": {
                "total": [570, 630],  # сумма всего времени бодрствования
                "average_duration": [110, 135],  # продолжительность 1 бодрствования
            },
            "feeding": {},  # особенности питания. пока не заморчаиваемся. сделаем позже
        },
        "night": {
            "total": [600, 660],  # продолжительность ночного сна
            "feedings": {  # количество кормлений за ночь, в зависимости от типа кормаления
                "breast": [3, 4],  # грудное вскармливание
                "formula": [1, 2],  # смесь
            },
        },
        "SLEEPS_ALL": [810, 870],  # все дневные сны + ночной сон
    },
    "6": {
        "day": {
            "sleep": {
                "total": [180, 210],  # сумма всех дневных снов
                "average_duration": [40, 90],  # продолжительность одного сна
                "amount": 3,  # количество снов днём
            },
            "activity": {
                "total": [615, 660],  # сумма всего времени бодрствования
                "average_duration": [150, 165],  # продолжительность 1 бодрствования
            },
            "feeding": {},  # особенности питания. пока не заморчаиваемся. сделаем позже
        },
        "night": {
            "total": [600, 660],  # продолжительность ночного сна
            "feedings": {  # количество кормлений за ночь, в зависимости от типа кормаления
                "breast": [3, 4],  # грудное вскармливание
                "formula": [1, 2],  # смесь
            },
        },
        "SLEEPS_ALL": [780, 825],  # все дневные сны + ночной сон
    },
    "7": {
        "day": {
            "sleep": {
                "total": [180, 210],  # сумма всех дневных снов
                "average_duration": [40, 90],  # продолжительность одного сна
                "amount": [3, 3],  # количество снов днём
            },
            "activity": {
                "total": [630, 660],  # сумма всего времени бодрствования
                "average_duration": [150, 165],  # продолжительность 1 бодрствования
            },
            "feeding": {},  # особенности питания. пока не заморчаиваемся. сделаем позже
        },
        "night": {
            "total": [600, 660],  # продолжительность ночного сна
            "feedings": {  # количество кормлений за ночь, в зависимости от типа кормаления
                "breast": [3, 4],  # грудное вскармливание
                "formula": [1, 2],  # смесь
            },
        },
        "SLEEPS_ALL": [780, 825],  # все дневные сны + ночной сон
    },
    "8": {
        "day": {
            "sleep": {
                "total": [150, 210],  # сумма всех дневных снов
                "average_duration": [40, 90],  # продолжительность одного сна
                "amount": [2, 3],  # количество снов днём
            },
            "activity": {
                "total": [630, 690],  # сумма всего времени бодрствования
                "average_duration": [165, 210],  # продолжительность 1 бодрствования
            },
            "feeding": {},  # особенности питания. пока не заморчаиваемся. сделаем позже
        },
        "night": {
            "total": [600, 660],  # продолжительность ночного сна
            "feedings": {  # количество кормлений за ночь, в зависимости от типа кормаления
                "breast": [2, 3],  # грудное вскармливание
                "formula": [1, 2],  # смесь
            },
        },
        "SLEEPS_ALL": [750, 810],  # все дневные сны + ночной сон
    },
    "9": {
        "day": {
            "sleep": {
                "total": [150, 210],  # сумма всех дневных снов
                "average_duration": [40, 90],  # продолжительность одного сна
                "amount": [2, 3],  # количество снов днём
            },
            "activity": {
                "total": [630, 690],  # сумма всего времени бодрствования
                "average_duration": [165, 210],  # продолжительность 1 бодрствования
            },
            "feeding": {},  # особенности питания. пока не заморчаиваемся. сделаем позже
        },
        "night": {
            "total": [600, 660],  # продолжительность ночного сна
            "feedings": {  # количество кормлений за ночь, в зависимости от типа кормаления
                "breast": [2, 3],  # грудное вскармливание
                "formula": [1, 2],  # смесь
            },
        },
        "SLEEPS_ALL": [750, 810],  # все дневные сны + ночной сон
    },
    "10": {
        "total_day_sleep": 100,
        "total_day_activity": 100,
        "total_night_sleep": 100,
    },
    "11": {
        "total_day_sleep": 100,
        "total_day_activity": 100,
        "total_night_sleep": 100,
    },
    "12": {
        "total_day_sleep": 100,
        "total_day_activity": 100,
        "total_night_sleep": 100,
    },
}
